NordicPlayground/nrf52-ble-image-transfer-demo/main.c
    err_code = sd_ble_opt_set(BLE_COMMON_OPT_CONN_EVT_EXT, &opt);
    APP_ERROR_CHECK(err_code);
}


/**@brief Application main function.
 */
int main(void)
{
    uint32_t img_data_length = 0;
    uint8_t img_data_buffer[255];
    
    bool erase_bonds;

    // Initialize.
    uart_init();
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
    sd_power_dcdc_mode_set(NRF_POWER_DCDC_ENABLE);
    
    // Start execution.
    NRF_LOG_INFO("Debug logging for UART over RTT started.");
      
    camera_init();

    //data_len_ext_set(true);

    //gatt_mtu_set(247);
    
    conn_evt_len_ext_set(true);

    advertising_start();

    // Enter main loop.
    for (;;)
    {
        uint32_t image_size;
        ble_gap_phys_t gap_phys_settings;    

        switch(m_new_command_received)
        {
            case APP_CMD_SINGLE_CAPTURE:
                m_new_command_received = APP_CMD_NOCOMMAND;
                //ble_its_send_file(&m_its, test_file, TEST_FILE_SIZE);
                if(arducam_mini_2mp_bytesAvailable() == 0)
                {
                    NRF_LOG_INFO("Starting capture...");
                    arducam_mini_2mp_startSingleCapture();
                    image_size = arducam_mini_2mp_bytesAvailable();
                    NRF_LOG_INFO("Capture complete: size %i bytes", (int)(image_size));
                    ble_its_img_info_t image_info;
                    image_info.file_size_bytes = image_size - 1;
                    ble_its_img_info_send(&m_its, &image_info);
                    
                    // Flush the first byte (or the JPG image will be corrupted)
                    arducam_mini_2mp_fillBuffer(img_data_buffer, 1);
                }
                break;
            
            case APP_CMD_START_STREAM:
                m_new_command_received = APP_CMD_NOCOMMAND;

                NRF_LOG_INFO("Stream mode enabled");                
                break;
                
            case APP_CMD_STOP_STREAM:
                m_new_command_received = APP_CMD_NOCOMMAND;
                m_stream_mode_active = false;
                NRF_LOG_INFO("Stream mode disabled");
                break;
                
            case APP_CMD_CHANGE_RESOLUTION:
                m_new_command_received = APP_CMD_NOCOMMAND;
                NRF_LOG_INFO("Change resolution to mode: %i", (int)m_new_resolution);
                switch(m_new_resolution)
                {
                    case 0:
                        arducam_mini_2mp_setResolution(OV2640_160x120);
                        break;
                    
                    case 1:
                        arducam_mini_2mp_setResolution(OV2640_320x240);
                        break;

                    case 2:
                        arducam_mini_2mp_setResolution(OV2640_640x480);
                        break;

                    case 3:
                        arducam_mini_2mp_setResolution(OV2640_800x600);
                        break;

                    case 4:
                        arducam_mini_2mp_setResolution(OV2640_1024x768);
                        break;
                    
                    case 5:
                        arducam_mini_2mp_setResolution(OV2640_1600x1200);
                        break;
                    
                } 
                break;
                
            case APP_CMD_CHANGE_PHY:   
                m_new_command_received = APP_CMD_NOCOMMAND;
            
                NRF_LOG_INFO("Attempting to change phy.");
                gap_phys_settings.tx_phys = (m_new_phy == 0 ? BLE_GAP_PHY_1MBPS : BLE_GAP_PHY_2MBPS);  
                gap_phys_settings.rx_phys = (m_new_phy == 0 ? BLE_GAP_PHY_1MBPS : BLE_GAP_PHY_2MBPS);  
        
                sd_ble_gap_phy_update(m_its.conn_handle, &gap_phys_settings);  
                break;
            
            case APP_CMD_SEND_BLE_PARAMS:
                m_new_command_received = APP_CMD_NOCOMMAND;
                ble_its_ble_params_info_send(&m_its, &m_ble_params_info);
                break;
            
            default:
                break;
        }
        
        if(m_stream_mode_active)
        {
            if(img_data_length == 0 && arducam_mini_2mp_bytesAvailable() == 0)
            {
                arducam_mini_2mp_startSingleCapture();

                image_size = arducam_mini_2mp_bytesAvailable();
                
                ble_its_img_info_t image_info;
                image_info.file_size_bytes = image_size - 1;
                ble_its_img_info_send(&m_its, &image_info);
                
                // Flush the first byte (or the JPG image will be corrupted)
                arducam_mini_2mp_fillBuffer(img_data_buffer, 1);
            }
        }
        
        if(img_data_length > 0 || arducam_mini_2mp_bytesAvailable() > 0)
        {
            if(img_data_length == 0)
            {
                img_data_length = arducam_mini_2mp_fillBuffer(img_data_buffer, m_ble_its_max_data_len);
            }
            if(ble_its_send_file_fragment(&m_its, img_data_buffer, img_data_length) == NRF_SUCCESS)
            {
                img_data_length = 0;
            }                
        }
        
        if(m_new_command_received == APP_CMD_NOCOMMAND)
        {
            idle_state_handle();
        }
    }
}


/**
 * @}
 */
